// ═══════════════════════════════════════════════════════════
// КОНФІГУРАЦІЯ ПІНІВ
// ═══════════════════════════════════════════════════════════
#define EXT_LED_PIN 2
#define BUTTON_PIN  5
#define LDR_PIN     34
#define DHTT_PIN    4
#define DHTT_TYPE   DHT22
// ═══════════════════════════════════════════════════════════
// ПОРОГОВІ ЗНАЧЕННЯ
// ═══════════════════════════════════════════════════════════
#define HIGH_TEMPERATURE_THRESHOLD    80
#define LOW_TEMPERATURE_THRESHOLD    -40
#define HIGH_HUMIDITY_THRESHOLD      100
#define LOW_HUMIDITY_THRESHOLD         0
#define LOW_LDR_THRESHOLD            200
//═══════════════════════════════════════════════════════════
// РЕЖИИМИ РОБОТИ
// ═══════════════════════════════════════════════════════════
#define SILENT_MODE      0x10  
#define MONITORING_MODE  0x12
// ═══════════════════════════════════════════════════════════
// ТАЙМЕРИ
// ═══════════════════════════════════════════════════════════
#define LDR_INTERVAL                    5000   // мс
#define DHTT_INTERVAL                   5000   // мс
#define SENSORS_MON_INTERVAL            5000   // мс
#define HTTP_POST_INTERVAL              30000  // мс
// ═══════════════════════════════════════════════════════════
// СТАТУС ПРИСТРОЮ
// ═══════════════════════════════════════════════════════════
#define STATUS_OK       0b00000000
// ═══════════════════════════════════════════════════════════
// DEBOUNCE
// ═══════════════════════════════════════════════════════════
#define DEBOUNCE 100  // мс
// ═══════════════════════════════════════════════════════════
// КОНФІГУРАЦІЯ WI-FI
// ═══════════════════════════════════════════════════════════
#define WIFI_SSID     "Wokwi-GUEST"
#define WIFI_PASSWORD ""
#define WIFI_TIMEOUT  10000  // мс

// ═══════════════════════════════════════════════════════════
// КОНФІГУРАЦІЯ HTTP
// ═══════════════════════════════════════════════════════════
#define SERVER_URL "http://httpbun.com/post"
